inditechcorporation/IndiChat-Ai/firmware/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32"

# WiFi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8

# WebSocket / HTTP
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# OPUS codec
CONFIG_ESP_OPUS_ENCODER=y

# I2S audio
CONFIG_I2S_SUPPRESS_DEPRECATE_WARN=y

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Stack sizes
CONFIG_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# NVS
CONFIG_NVS_ENCRYPTION=n
